{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend entry point.",
  "feature_evidence.json": "Empty feature evidence report with no documented features.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files including components, pages, utilities, and configuration files with detailed descriptions of their functionality.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes with comprehensive design tokens.",
  "frontend/index.html": "HTML entry point that loads the React application via main.tsx module script.",
  "frontend/src/App.tsx": "Root React component that wraps the Dashboard with QueryClient, ThemeProvider (dark mode default), and Toaster for notifications.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright year and attribution link to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/Header.tsx": "Application header with branding, theme toggle button, optional settings button for token configuration, and optional publish button with loading state.",
  "frontend/src/components/TokenConfigDialog.tsx": "Dialog component for managing token whitelist with add/edit/delete operations, form validation, table display, and integration with tokenConfig utility functions.",
  "frontend/src/components/TokenList.tsx": "Component that fetches trust lines from two monitored XRPL wallets, filters them against the token whitelist configuration, and displays matching tokens with extensive debug logging for troubleshooting.",
  "frontend/src/components/TokenMetrics.tsx": "Token detail view showing holdings across monitored wallets with collapsible Layer 2 Trust Lines section that displays all trust lines per wallet with hex-to-ASCII conversion and visual highlighting of the current token.",
  "frontend/src/components/WalletHoldings.tsx": "React component that displays XRPL wallet holdings including XRP balance, trust lines, and NFTs with tabs and refresh functionality. Validates wallet addresses and fetches data from XRPL using the xrpl library functions.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the Internet Computer backend actor, creating authenticated or anonymous actors based on Internet Identity state. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state and identity persistence. Handles AuthClient creation with configurable options and delegation identity validation.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating that data fetching is handled directly in components using XRPL client library functions instead of backend actor queries.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components including primary, secondary, destructive, and chart colors.",
  "frontend/src/lib/tokenConfig.ts": "Manages XRPL token whitelist configuration with 11 default tokens (GreedyJEW, JewNomicaN, HEBROID, etc.), providing functions to load/save token configs from localStorage and convert between hex and ASCII currency codes.",
  "frontend/src/lib/xrpl.ts": "XRPL client library providing functions to fetch account info, trust lines, and NFTs from multiple XRPL servers with retry logic and automatic failover. Includes address validation and detailed request/response logging.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page component that manages view state (tokens/metrics/holdings), handles token and wallet selection, and provides navigation between different views with back button functionality. Includes a publish button that simulates deployment and a token configuration dialog.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom theme extensions including OKLCH color system, custom animations (accordion), typography, container queries, and font families (Inter, JetBrains Mono).",
  "project_state.json": "Project metadata file documenting the multi-chain XRP Ledger monitoring application architecture, tracking two specific wallets (issuer and dev), with features for token whitelisting, split-screen layout, DEX price fetching, and network switching between XRPL/Xahau."
}