{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: token configuration interface, trust line filtering by whitelist, default token pre-population (GreedyJEW and Jewnomican), and settings navigation access.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing components for XRPL portfolio monitoring with token configuration, wallet tracking, and theme support.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for the application's design tokens.",
  "frontend/index.html": "HTML entry point that loads the React application with viewport configuration and title 'XRP Portfolio Monitor'.",
  "frontend/src/App.tsx": "Root React component wrapping the Dashboard with QueryClient for data fetching, ThemeProvider for dark/light mode, and Toaster for notifications.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright year and attribution link to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/Header.tsx": "Application header with branding, theme toggle button, settings button for token configuration, and optional publish button with loading state.",
  "frontend/src/components/TokenConfigDialog.tsx": "Dialog component for managing token whitelist with add/edit/delete operations, form validation for currency codes and issuer addresses, and localStorage persistence.",
  "frontend/src/components/TokenList.tsx": "Component fetching and displaying trust lines from two monitored XRPL wallets (GreedyJEW Issuer and Project Dev Wallet), filtered by user-configured token whitelist with per-wallet error handling and retry functionality.",
  "frontend/src/components/TokenMetrics.tsx": "React component that displays token metrics by fetching and showing holdings from predefined wallets (GreedyJEW Issuer and Project Dev Wallet), with loading states, error handling, and refresh functionality.",
  "frontend/src/components/WalletHoldings.tsx": "React component that displays comprehensive wallet data including account info, trust lines, and NFTs for a given XRPL address, organized in tabs with loading and error states.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity login state and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom React hook and provider for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating that data fetching is handled directly in components using XRPL client library functions instead of backend actor queries.",
  "frontend/src/index.css": "Tailwind CSS configuration file defining CSS custom properties for light and dark themes, including colors for UI components, charts, and sidebar elements.",
  "frontend/src/lib/tokenConfig.ts": "Token configuration management module that handles loading, saving, adding, removing, and updating XRPL token configurations in localStorage with validation and default tokens (GreedyJEW and Jewnomican).",
  "frontend/src/lib/xrpl.ts": "XRPL client library providing functions to fetch account info, trust lines, and NFTs from XRPL servers with retry logic, server fallback, address validation, and comprehensive logging.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient provider for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page component managing three view states (tokens, metrics, holdings) with navigation between them, publish functionality, and a token configuration dialog that triggers data refresh.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, extended theme with custom animations, border radius variables, and typography/container-queries/animate plugins.",
  "project_state.json": "Project metadata tracking a multi-chain XRP Ledger monitoring app for two specific wallets (issuer and dev), with known issue that dashboard shows all 210+ trust lines instead of only whitelisted tokens."
}