{
  "backend/main.mo": "Empty Motoko actor file serving as a placeholder for backend logic.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features for filtering TokenMetrics.tsx to display only the wallet holding the selected token and implementing logic to determine wallet relevance by checking balances or trust lines.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing their roles in the XRP portfolio monitoring application, including components for token display, wallet tracking, XRPL API integration, and configuration management.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes with purple/blue gradient accent colors.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component wrapping the Dashboard with QueryClient for data fetching, ThemeProvider for dark/light mode, and Toaster for notifications.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright information and a branded link to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/Header.tsx": "Application header with branding, theme toggle button, optional settings button for token configuration, and optional publish button with loading state.",
  "frontend/src/components/TokenConfigDialog.tsx": "Dialog component for managing token whitelist with add, edit, and delete operations, form validation, and integration with tokenConfig storage module.",
  "frontend/src/components/TokenList.tsx": "Component that fetches trust lines from two monitored XRPL wallets, filters tokens against a whitelist configuration, and displays them with extensive debug logging for troubleshooting currency code matching issues.",
  "frontend/src/components/TokenMetrics.tsx": "Displays token metrics including monitored wallet holdings and trust lines for a selected token. Fetches and displays balance data from predefined XRPL wallets (GreedyJEW Issuer and Project Dev Wallet) with collapsible trust line details.",
  "frontend/src/components/WalletHoldings.tsx": "Shows detailed holdings for a specific XRPL wallet address including account info, trust lines, and NFTs in a tabbed interface. Validates addresses and provides refresh functionality with error handling.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous actor for backend communication using Internet Identity. Invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality with AuthClient. Manages identity state, login status, and delegation validation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating that data fetching is handled directly in components using XRPL client library functions instead of backend actor queries.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like backgrounds, borders, charts, and sidebar components.",
  "frontend/src/lib/tokenConfig.ts": "Manages XRPL token configuration with 11 default whitelisted tokens, providing utilities for hex/string currency code conversion and localStorage persistence. Includes tokens like GreedyJEW, JewNomicaN, HEBROID, ASC, RPR, and others.",
  "frontend/src/lib/xrpl.ts": "XRPL client library providing functions to fetch account info, trust lines, and NFTs from multiple public XRPL servers with retry logic, exponential backoff, address validation, and automatic server failover.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient provider for data fetching and InternetIdentity provider for authentication.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page managing three view states (tokens, metrics, holdings) with navigation between token list, token metrics, and wallet holdings views, plus publish functionality and token configuration dialog.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, extended theme with custom animations, typography, and container query plugins.",
  "project_state.json": "Project metadata tracking multi-chain XRPL monitoring app architecture for two wallets (issuer and dev), with split-screen layout, token whitelist filtering, DEX price integration, and known issues with wallet display filtering."
}