{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Show only relevant wallet in token detail view",
  "requirements": [
    {
      "id": "REQ-40",
      "summary": "Display only the wallet that holds the selected token in TokenMetrics view instead of showing both monitored wallets",
      "acceptanceCriteria": [
        "When viewing token details, only the wallet that actually holds the token is displayed",
        "The issuer wallet (rdRvw4pKmEtSnz3cjXBL6HLJJmejtkoQ4) is shown for tokens it issues",
        "The dev wallet (rw3DPxgusRrvdsbXSjHdXD14ogkNidTTRx) is shown when it holds the token",
        "The unnecessary duplicate wallet display is completely removed from the view"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TokenMetrics.tsx",
          "operation": "modify",
          "description": "Filter the MONITORED_WALLETS array to show only wallets that hold the selected token with a non-zero balance. Add filtering logic before rendering the wallet sections that checks each wallet's trust lines for the selected token (matching both currency and issuer). Preserve the existing Layer 2 Trust Lines collapsible section functionality and wallet label logic (Vault for Schmeckles, Dev Hoard for others). Handle both standard and hex-encoded currency codes when matching trust lines."
        }
      ]
    },
    {
      "id": "REQ-41",
      "summary": "Implement filtering logic to determine which wallet is relevant for each token by checking trust line balances",
      "acceptanceCriteria": [
        "The component checks trust line balances from both monitored wallets",
        "Only wallets with non-zero balances for the selected token are displayed",
        "If a token is issued by one wallet and held by the other, both relationships are correctly identified",
        "The filtering logic handles both standard and hex-encoded currency codes"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TokenMetrics.tsx",
          "operation": "modify",
          "description": "Add a helper function that takes a wallet address, its trust lines, and the selected token, then returns whether the wallet is relevant by checking if any trust line matches the token's currency code (handling hex encoding) and issuer address, and has a non-zero balance. Use this function to filter MONITORED_WALLETS before rendering. Ensure the logic correctly identifies both issuer wallets and holder wallets for the selected token."
        }
      ]
    }
  ]
}